app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('asdasd', 'asdsadassdad', '2020-09-10 08:59:39.563602', '2020-09-10 08:59:39.563602')
---
  def create
  	@article = Article.new(article_params)
    if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'asdasdasdasd', `articles`.`updated_at` = '2020-09-10 08:59:50.509581' WHERE `articles`.`id` = 9
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)